Tekla.Structures.ModelInternal.RebarGuideline
Defines a guideline that is used in a rebar set.

Tekla.Structures.ModelInternal.RebarGuideline.#ctor
Initializes a new instance of the Tekla.Structures.ModelInternal.RebarGuideline class.

Tekla.Structures.ModelInternal.RebarGuideline.CloneRebarGuideline
Clone RebarGuideline.
Returns: The Tekla.Structures.ModelInternal.RebarGuideline.

Tekla.Structures.ModelInternal.RebarGuideline.CreateInstance
The create instance.
Returns:
The System.Boolean.

Tekla.Structures.ModelInternal.RebarGuideline.SelectInstance(System.Int32)
The select instance.
id:
The id.
Returns:
The System.Boolean.

Tekla.Structures.ModelInternal.RebarGuideline.ToStruct(Tekla.Structures.ModelInternal.dotGuideline_t@)
The to struct.
dotGuideline:
The dot guideline.

Tekla.Structures.ModelInternal.RebarGuideline.FromStruct(Tekla.Structures.ModelInternal.dotGuideline_t@)
The from struct.
dotGuideline:
The dot guideline.

Tekla.Structures.ModelInternal.RebarGuideline.Id
Gets an identifier that may be used to identify instances of the same guideline.

Tekla.Structures.ModelInternal.RebarGuideline.StartExtend
Gets or sets a value indicating whether the guideline start point is extended to the outer boundary of a containing leg face.

Tekla.Structures.ModelInternal.RebarGuideline.EndExtend
Gets or sets a value indicating whether the guideline end point is extended to the outer boundary of a containing leg face.

Tekla.Structures.ModelInternal.RebarGuideline.Curve
Gets or sets the geometric curve of the guideline.

Tekla.Structures.ModelInternal.RebarGuideline.Spacing
Gets or sets the spacing along this guideline.